RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_emac.c
/**
  ******************************************************************************
  * @file    bl808_emac.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl808.h"
#include "bl808_emac.h"
#include "bl808_glb.h"

/** @addtogroup  BL808_Peripheral_Driver
 *  @{
 */

/** @addtogroup  EMAC
 *  @{
 */

/** @defgroup  EMAC_Private_Macros
 *  @{
 */
#define PHY_MAX_RETRY (0x3F)

/*@} end of group EMAC_Private_Macros */

/** @defgroup  EMAC_Private_Types
 *  @{
 */

/*@} end of group EMAC_Private_Types */

/** @defgroup  EMAC_Private_Variables
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
static intCallback_Type *emacIntCbfArra[EMAC_ID_MAX][EMAC_INT_CNT] = { {NULL} };
#endif

static const uint32_t emacAddr[EMAC_ID_MAX] = { EMAC_BASE };

/*@} end of group EMAC_Private_Variables */

/** @defgroup  EMAC_Global_Variables
 *  @{
 */

/*@} end of group EMAC_Global_Variables */

/** @defgroup  EMAC_Private_Fun_Declaration
 *  @{
 */

/*@} end of group EMAC_Private_Fun_Declaration */

/** @defgroup  EMAC_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  Set MAC Address
 *
 * @param  emacId: EMAC ID type
 * @param  macAddr[6]: MAC address buffer array
 *
 * @return None
 *
*******************************************************************************/
static void EMAC_SetMACAddress(EMAC_ID_Type emacId, uint8_t macAddr[6])
{
    uint32_t EMACx = emacAddr[emacId];
    BL_WR_REG(EMACx, EMAC_MAC_ADDR1, (macAddr[0] << 8) | macAddr[1]);
    BL_WR_REG(EMACx, EMAC_MAC_ADDR0, (macAddr[2] << 24) | (macAddr[3] << 16) | (macAddr[4] << 8) | (macAddr[5] << 0));
}

/****************************************************************************/ /**
 * @brief  Set PHY Address
 *
 * @param  emacId: EMAC ID type
 * @param  phyAddress: Phy address
 *
 * @return None
 *
*******************************************************************************/
void EMAC_Phy_SetAddress(EMAC_ID_Type emacId, uint16_t phyAddress)
{
    uint32_t tmpVal;
    uint32_t EMACx = emacAddr[emacId];

    /* Set Phy Address */
    tmpVal = BL_RD_REG(EMACx, EMAC_MIIADDRESS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_FIAD, phyAddress);
    BL_WR_REG(EMACx, EMAC_MIIADDRESS, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Set PHY Address
 *
 * @param  emacId: EMAC ID type
 * @param  phyAddress: Phy address
 *
 * @return None
 *
*******************************************************************************/
void EMAC_Phy_Set_Full_Duplex(EMAC_ID_Type emacId, uint8_t fullDuplex)
{
    uint32_t tmpVal;
    uint32_t EMACx = emacAddr[emacId];

    /* Set MAC duplex config */
    tmpVal = BL_RD_REG(EMACx, EMAC_MODE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_FULLD, fullDuplex);
    BL_WR_REG(EMACx, EMAC_MODE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Read PHY register
 *
 * @param  emacId: EMAC ID type
 * @param  phyReg: PHY register
 * @param  regValue: PHY register value pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_Phy_Read(EMAC_ID_Type emacId, uint16_t phyReg, uint16_t *regValue)
{
    uint32_t tmpVal;
    uint32_t EMACx = emacAddr[emacId];

    /* Set Register Address */
    tmpVal = BL_RD_REG(EMACx, EMAC_MIIADDRESS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_RGAD, phyReg);
    BL_WR_REG(EMACx, EMAC_MIIADDRESS, tmpVal);

    /* Trigger read */
    tmpVal = BL_RD_REG(EMACx, EMAC_MIICOMMAND);
    tmpVal = BL_SET_REG_BIT(tmpVal, EMAC_RSTAT);
    BL_WR_REG(EMACx, EMAC_MIICOMMAND, tmpVal);

    BL_DRV_DUMMY;

    do {
        tmpVal = BL_RD_REG(EMACx, EMAC_MIISTATUS);
        arch_delay_us(16);
    } while (BL_IS_REG_BIT_SET(tmpVal, EMAC_MIIM_BUSY));

    *regValue = BL_RD_REG(EMACx, EMAC_MIIRX_DATA);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Write PHY register
 *
 * @param  emacId: EMAC ID type
 * @param  phyReg: PHY register
 * @param  regValue: PHY register value
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_Phy_Write(EMAC_ID_Type emacId, uint16_t phyReg, uint16_t regValue)
{
    uint32_t tmpVal;
    uint32_t EMACx = emacAddr[emacId];

    /* Set Register Address */
    tmpVal = BL_RD_REG(EMACx, EMAC_MIIADDRESS);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_RGAD, phyReg);
    BL_WR_REG(EMACx, EMAC_MIIADDRESS, tmpVal);

    /* Set Write data */
    BL_WR_REG(EMACx, EMAC_MIITX_DATA, regValue);

