RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_emac.c
    /* Trigger write */
    tmpVal = BL_RD_REG(EMACx, EMAC_MIICOMMAND);
    tmpVal = BL_SET_REG_BIT(tmpVal, EMAC_WCTRLDATA);
    BL_WR_REG(EMACx, EMAC_MIICOMMAND, tmpVal);

    BL_DRV_DUMMY;

    do {
        tmpVal = BL_RD_REG(EMACx, EMAC_MIISTATUS);
    } while (BL_IS_REG_BIT_SET(tmpVal, EMAC_MIIM_BUSY));

    return SUCCESS;
}

/*@} end of group EMAC_Private_Functions */

/** @defgroup  EMAC_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  Initialize EMAC module
 *
 * @param  emacId: EMAC ID type
 * @param  cfg: EMAC configuration pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_Init(EMAC_ID_Type emacId, EMAC_CFG_Type *cfg)
{
    uint32_t tmpVal;
    uint32_t EMACx = emacAddr[emacId];

    /* Disable clock gate */
    //GLB_AHB_Slave2_Clock_Gate(DISABLE, BL_AHB_SLAVE2_EXT_EMAC);

    /* Set MAC config */
    tmpVal = BL_RD_REG(EMACx, EMAC_MODE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_RMII_EN, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_RECSMALL, cfg->recvSmallFrame);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_PAD, cfg->padEnable);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_HUGEN, cfg->recvHugeFrame);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_CRCEN, cfg->crcEnable);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_NOPRE, cfg->noPreamble);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_BRO, cfg->recvBroadCast);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_PRO, ENABLE);
    //tmpVal |= (1 << 7); /* local loopback in emac */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_IFG, cfg->interFrameGapCheck);
    BL_WR_REG(EMACx, EMAC_MODE, tmpVal);

    /* Set inter frame gap value */
    BL_WR_REG(EMACx, EMAC_IPGT, cfg->interFrameGapValue);

    /* Set MII interface */
    tmpVal = BL_RD_REG(EMACx, EMAC_MIIMODE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_MIINOPRE, cfg->miiNoPreamble);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_CLKDIV, cfg->miiClkDiv);
    BL_WR_REG(EMACx, EMAC_MIIMODE, tmpVal);

    /* Set collision */
    tmpVal = BL_RD_REG(EMACx, EMAC_COLLCONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_MAXRET, cfg->maxTxRetry);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_COLLVALID, cfg->collisionValid);
    BL_WR_REG(EMACx, EMAC_COLLCONFIG, tmpVal);

    /* Set frame length */
    tmpVal = BL_RD_REG(EMACx, EMAC_PACKETLEN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_MINFL, cfg->minFrameLen);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EMAC_MAXFL, cfg->maxFrameLen);
    BL_WR_REG(EMACx, EMAC_PACKETLEN, tmpVal);

    EMAC_SetMACAddress(emacId, cfg->macAddr);

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(EMAC_IRQn, EMAC0_IRQHandler);
#endif
    return SUCCESS;
}

/****************************************************************************/ /**

 * @brief  DeInitialize EMAC module
 *
 * @param  emacId: EMAC ID type
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_DeInit(EMAC_ID_Type emacId)
{
    EMAC_Disable(emacId);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Initialize EMAC TX RX MDA buffer
 *
 * @param  emacId: EMAC ID type
 * @param  handle: EMAC handle pointer
 * @param  txBuff: TX buffer
 * @param  txBuffCount: TX buffer count
 * @param  rxBuff: RX buffer
 * @param  rxBuffCount: RX buffer count
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_DMADescListInit(EMAC_ID_Type emacId, EMAC_Handle_Type *handle, uint8_t *txBuff, uint32_t txBuffCount, uint8_t *rxBuff, uint32_t rxBuffCount)
{
    uint32_t i = 0;
    uint32_t EMACx = emacAddr[emacId];

    /* Set the Ethernet handler env */
    handle->bd = (EMAC_BD_Desc_Type *)(uintptr_t)(EMACx + EMAC_DMA_DESC_OFFSET);
    handle->txIndexEMAC = 0;
    handle->txIndexCPU = 0;
    handle->txBuffLimit = txBuffCount - 1;
    /* The receive descriptors' address starts right after the last transmit BD. */
    handle->rxIndexEMAC = txBuffCount;
    handle->rxIndexCPU = txBuffCount;
    handle->rxBuffLimit = txBuffCount + rxBuffCount - 1;

    /* Fill each DMARxDesc descriptor with the right values */
    for (i = 0; i < txBuffCount; i++) {
        /* Get the pointer on the ith member of the Tx Desc list */
        handle->bd[i].Buffer = (NULL == txBuff) ? 0 : (uint32_t)(uintptr_t)(txBuff + (ETH_MAX_PACKET_SIZE * i));
        handle->bd[i].C_S_L = 0;
    }

    /* For the last TX DMA Descriptor, it should be wrap back */
    handle->bd[handle->txBuffLimit].C_S_L |= EMAC_BD_FIELD_MSK(TX_WR);

    for (i = txBuffCount; i < (txBuffCount + rxBuffCount); i++) {
        /* Get the pointer on the ith member of the Rx Desc list */
        handle->bd[i].Buffer = (NULL == rxBuff) ? 0 : (uint32_t)(uintptr_t)(rxBuff + (ETH_MAX_PACKET_SIZE * (i - txBuffCount)));
        handle->bd[i].C_S_L = (ETH_MAX_PACKET_SIZE << 16) |
                              EMAC_BD_FIELD_MSK(RX_IRQ) |
                              EMAC_BD_FIELD_MSK(RX_E);
    }

    /* For the last RX DMA Descriptor, it should be wrap back */
    handle->bd[handle->rxBuffLimit].C_S_L |= EMAC_BD_FIELD_MSK(RX_WR);

    /* For the TX DMA Descriptor, it will wrap to 0 according to EMAC_TX_BD_NUM*/
    BL_WR_REG(EMACx, EMAC_TX_BD_NUM, txBuffCount);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Get TX MDA buffer descripter for data to send
 *
 * @param  handle: EMAC handle pointer
 * @param  txDMADesc: TX DMA descriptor pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_DMATxDescGet(EMAC_Handle_Type *handle, EMAC_BD_Desc_Type **txDMADesc)
{
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Start TX
 *
 * @param  handle: EMAC handle pointer
 * @param  txDMADesc: TX DMA descriptor pointer
 * @param  len: len
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_StartTx(EMAC_Handle_Type *handle, EMAC_BD_Desc_Type *txDMADesc, uint32_t len)
{
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Enable EMAC module
 *
 * @param  emacId: EMAC ID type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_Enable(EMAC_ID_Type emacId)
{
    uint32_t tmpVal;
    uint32_t EMACx = emacAddr[emacId];

    /* Enable EMAC */
    tmpVal = BL_RD_REG(EMACx, EMAC_MODE);
    tmpVal = BL_SET_REG_BIT(tmpVal, EMAC_TXEN);
    tmpVal = BL_SET_REG_BIT(tmpVal, EMAC_RXEN);
    BL_WR_REG(EMACx, EMAC_MODE, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  EMAC_Enable_TX
 *
 * @param  emacId: EMAC ID type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_Enable_TX(EMAC_ID_Type emacId)
{
    uint32_t tmpVal;
    uint32_t EMACx = emacAddr[emacId];

    /* Enable EMAC */
    tmpVal = BL_RD_REG(EMACx, EMAC_MODE);
    tmpVal = BL_SET_REG_BIT(tmpVal, EMAC_TXEN);
    BL_WR_REG(EMACx, EMAC_MODE, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  EMAC_Disable_TX
 *
 * @param  emacId: EMAC ID type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_Disable_TX(EMAC_ID_Type emacId)
{
    uint32_t tmpVal;
    uint32_t EMACx = emacAddr[emacId];

    /* Enable EMAC */
    tmpVal = BL_RD_REG(EMACx, EMAC_MODE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, EMAC_TXEN);
    BL_WR_REG(EMACx, EMAC_MODE, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  EMAC_Enable_RX
 *
 * @param  emacId: EMAC ID type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_Enable_RX(EMAC_ID_Type emacId)
{
    uint32_t tmpval;
    uint32_t EMACx = emacAddr[emacId];

