RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_emac.c
    /* Enable EMAC TX*/
    tmpval = BL_RD_REG(EMACx, EMAC_MODE);
    tmpval = BL_SET_REG_BIT(tmpval, EMAC_RXEN);
    BL_WR_REG(EMACx, EMAC_MODE, tmpval);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  EMAC_Disable_RX
 *
 * @param  emacId: EMAC ID type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_Disable_RX(EMAC_ID_Type emacId)
{
    uint32_t tmpval;
    uint32_t EMACx = emacAddr[emacId];

    /* Disable EMAC RX*/
    tmpval = BL_RD_REG(EMACx, EMAC_MODE);
    tmpval = BL_CLR_REG_BIT(tmpval, EMAC_RXEN);
    BL_WR_REG(EMACx, EMAC_MODE, tmpval);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Disable EMAC module
 *
 * @param  emacId: EMAC ID type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_Disable(EMAC_ID_Type emacId)
{
    uint32_t tmpVal;
    uint32_t EMACx = emacAddr[emacId];

    /* Enable EMAC */
    tmpVal = BL_RD_REG(EMACx, EMAC_MODE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, EMAC_TXEN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, EMAC_RXEN);
    BL_WR_REG(EMACx, EMAC_MODE, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  EMAC mask or unmask certain or all interrupt
 *
 * @param  emacId: EMAC ID type
 * @param  intType: EMAC interrupt type
 * @param  intMask: EMAC interrupt mask value( MASK:disbale interrupt,UNMASK:enable interrupt )
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_IntMask(EMAC_ID_Type emacId, EMAC_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal;
    uint32_t EMACx = emacAddr[emacId];

    /* Check the parameters */
    CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

    tmpVal = BL_RD_REG(EMACx, EMAC_INT_MASK);

    /* Mask or unmask certain or all interrupt */
    if (MASK == intMask) {
        tmpVal |= intType;
    } else {
        tmpVal &= (~intType);
    }

    /* Write back */
    BL_WR_REG(EMACx, EMAC_INT_MASK, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Get EMAC interrupt status
 *
 * @param  emacId: EMAC ID type
 * @param  intType: EMAC interrupt type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Sts_Type EMAC_GetIntStatus(EMAC_ID_Type emacId, EMAC_INT_Type intType)
{
    uint32_t tmpVal;
    uint32_t EMACx = emacAddr[emacId];

    /* Check the parameters */
    CHECK_PARAM(IS_EMAC_INT_TYPE(intType));

    tmpVal = BL_RD_REG(EMACx, EMAC_INT_SOURCE);

    return (tmpVal & intType) ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  Clear EMAC interrupt
 *
 * @param  emacId: EMAC ID type
 * @param  intType: EMAC interrupt type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_ClrIntStatus(EMAC_ID_Type emacId, EMAC_INT_Type intType)
{
    uint32_t tmpVal;
    uint32_t EMACx = emacAddr[emacId];

    /* Check the parameters */
    CHECK_PARAM(IS_EMAC_INT_TYPE(intType));

    tmpVal = BL_RD_REG(EMACx, EMAC_INT_SOURCE);

    BL_WR_REG(EMACx, EMAC_INT_SOURCE, tmpVal | intType);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  EMAC_Int_Callback_Install
 *
 * @param  emacId: EMAC ID type
 * @param  intIdx: EMAC_INT_Index
 * @param  cbFun: call back
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
BL_Err_Type EMAC_Int_Callback_Install(EMAC_ID_Type emacId, EMAC_INT_Index intIdx, intCallback_Type *cbFun)
{
    /* Check the parameters */

    emacIntCbfArra[emacId][intIdx] = cbFun;

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  EMAC_IRQHandler
 *
 * @param  emacId: EMAC ID type
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void EMAC_IRQHandler(EMAC_ID_Type emacId)
{
    uint32_t tmpVal;
    uint32_t EMACx = emacAddr[emacId];

    tmpVal = BL_RD_REG(EMACx, EMAC_INT_MASK);

    if (SET == EMAC_GetIntStatus(emacId, EMAC_INT_TX_DONE) && !BL_IS_REG_BIT_SET(tmpVal, EMAC_TXB_M)) {
        EMAC_ClrIntStatus(emacId, EMAC_INT_TX_DONE);

        if (emacIntCbfArra[emacId][EMAC_INT_TX_DONE_IDX]) {
            emacIntCbfArra[emacId][EMAC_INT_TX_DONE_IDX]();
        }
    }

    if (SET == EMAC_GetIntStatus(emacId, EMAC_INT_TX_ERROR) && !BL_IS_REG_BIT_SET(tmpVal, EMAC_TXE_M)) {
        EMAC_ClrIntStatus(emacId, EMAC_INT_TX_ERROR);

        if (emacIntCbfArra[emacId][EMAC_INT_TX_ERROR_IDX]) {
            emacIntCbfArra[emacId][EMAC_INT_TX_ERROR_IDX]();
        }
    }

    if (SET == EMAC_GetIntStatus(emacId, EMAC_INT_RX_DONE) && !BL_IS_REG_BIT_SET(tmpVal, EMAC_RXB_M)) {
        EMAC_ClrIntStatus(emacId, EMAC_INT_RX_DONE);

        if (emacIntCbfArra[emacId][EMAC_INT_RX_DONE_IDX]) {
            emacIntCbfArra[emacId][EMAC_INT_RX_DONE_IDX]();
        }
    }

    if (SET == EMAC_GetIntStatus(emacId, EMAC_INT_RX_ERROR) && !BL_IS_REG_BIT_SET(tmpVal, EMAC_RXE_M)) {
        EMAC_ClrIntStatus(emacId, EMAC_INT_RX_ERROR);

        if (emacIntCbfArra[emacId][EMAC_INT_RX_ERROR_IDX]) {
            emacIntCbfArra[emacId][EMAC_INT_RX_ERROR_IDX]();
        }
    }

    if (SET == EMAC_GetIntStatus(emacId, EMAC_INT_RX_BUSY) && !BL_IS_REG_BIT_SET(tmpVal, EMAC_BUSY_M)) {
        EMAC_ClrIntStatus(emacId, EMAC_INT_RX_BUSY);

        if (emacIntCbfArra[emacId][EMAC_INT_RX_BUSY_IDX]) {
            emacIntCbfArra[emacId][EMAC_INT_RX_BUSY_IDX]();
        }
    }

    if (SET == EMAC_GetIntStatus(emacId, EMAC_INT_TX_CTRL) && !BL_IS_REG_BIT_SET(tmpVal, EMAC_TXC_M)) {
        EMAC_ClrIntStatus(emacId, EMAC_INT_TX_CTRL);

        if (emacIntCbfArra[emacId][EMAC_INT_TX_CTRL_IDX]) {
            emacIntCbfArra[emacId][EMAC_INT_TX_CTRL_IDX]();
        }
    }

