RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_emac.c
    if (SET == EMAC_GetIntStatus(emacId, EMAC_INT_RX_CTRL) && !BL_IS_REG_BIT_SET(tmpVal, EMAC_RXC_M)) {
        EMAC_ClrIntStatus(emacId, EMAC_INT_RX_CTRL);

        if (emacIntCbfArra[emacId][EMAC_INT_RX_CTRL_IDX]) {
            emacIntCbfArra[emacId][EMAC_INT_RX_CTRL_IDX]();
        }
    }
}
#endif

/****************************************************************************/ /**
 * @brief  EMAC0 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void EMAC0_IRQHandler(void)
{
    EMAC_IRQHandler(EMAC0_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  Request to pause TX
 *
 * @param  emacId: EMAC ID type
 * @param  timeCount: Pause time count
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_TxPauseReq(EMAC_ID_Type emacId, uint16_t timeCount)
{
    uint32_t EMACx = emacAddr[emacId];

    BL_WR_REG(EMACx, EMAC_TXCTRL, (1 << 16) | timeCount);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Set hash value
 *
 * @param  emacId: EMAC ID type
 * @param  hash0: Hash value one
 * @param  hash1: Hash value two
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_SetHash(EMAC_ID_Type emacId, uint32_t hash0, uint32_t hash1)
{
    uint32_t EMACx = emacAddr[emacId];

    BL_WR_REG(EMACx, EMAC_HASH0_ADDR, hash0);

    BL_WR_REG(EMACx, EMAC_HASH1_ADDR, hash1);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Get fram maximum len and minimum
 *
 * @param  emacId: EMAC ID type
 * @param  max: point to maximum fram len
 * @param  min: point to minimum fram len
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_GetFramLen(EMAC_ID_Type emacId, uint16_t * max, uint16_t *min)
{
    uint32_t EMACx = emacAddr[emacId];
    uint32_t tmpval;

    tmpval = BL_RD_REG(EMACx, EMAC_PACKETLEN);
    *max = BL_GET_REG_BITS_VAL(tmpval, EMAC_MAXFL);
    *min = BL_GET_REG_BITS_VAL(tmpval, EMAC_MINFL);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Get BD numbers
 *
 * @param  emacId: EMAC ID type
 * @param  bd: point to BD num
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type EMAC_GetBD(EMAC_ID_Type emacId, uint32_t *bd)
{
    uint32_t EMACx = emacAddr[emacId];

    *bd = BL_RD_REG(EMACx, EMAC_TX_BD_NUM);

    return SUCCESS;
}
/*@} end of group EMAC_Public_Functions */

/*@} end of group EMAC */

/*@} end of group BL808_Peripheral_Driver */
